Kvasir/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    walls
    {
        type            walls;
        nFaces          2000;
        startFace       51500;
        faces           ( ( 0 1 17 16 ) ( 1 2 18 17 ) ( 2 3 19 18 ) ( 3 4 20 19 ) ( 26 20 4 10 ) ( 31 26 10 15 ) ( 30 31 15 14 ) ( 29 30 14 13 ) ( 28 29 13 12 ) ( 27 28 12 11 ) ( 11 5 21 27 ) ( 5 0 16 21 ) ( 11 12 6 5 ) ( 5 6 1 0 ) ( 12 13 8 6 ) ( 13 14 9 8 ) ( 14 15 10 9 ) ( 9 10 4 3 ) ( 7 9 3 2 ) ( 6 7 2 1 ) );
    }
    nozzleExt
    {
        type            walls;
        nFaces          400;
        startFace       53500;
        faces           ( ( 6 8 39 37 ) ( 38 39 8 9 ) ( 7 6 37 36 ) ( 9 7 36 38 ) );
    }
    nozzleInt
    {
        type            patch;
        nFaces          400;
        startFace       53900;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       54300;
    }
    outlet
    {
        type            patch;
        nFaces          800;
        startFace       54400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1300;
        startFace       55200;
    }
)

// ************************************************************************* //
