Kvasir/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    //Back Wall
    (0 0 10)
    (0 0 8)
    (0 0 5)
    (0 0 2)
    (0 0 0)
    (0 5 10)
    (0 5 8)
    (0 2 5)
    (0 8 5)
    (0 5 2)
    (0 5 0)
    (0 10 10)
    (0 10 8)
    (0 10 5)
    (0 10 2)
    (0 10 0)

    // End of nozzle
    (13 0 10)
    (13 0 9)
    (13 0 5)
    (13 0 1)
    (13 0 0)
    (13 5 10)
    (13 5 9)
    (13 1 5)
    (13 9 5)
    (13 5 1)
    (13 5 0)
    (13 10 10)
    (13 10 9)
    (13 10 5)
    (13 10 1)
    (13 10 0)

    // Throat
    (3.85 3.79 5)
    (3.85 5 6.21)
    (3.85 5 3.79)
    (3.85 6.21 5)

    // Exit
    (13 2 5)
    (13 5 8)
    (13 5 2)
    (13 8 5)

    // End of nozzle
    (30 0 10)
    (30 0 9)
    (30 0 5)
    (30 0 1)
    (30 0 0)
    (30 5 10)
    (30 5 9)
    (30 1 5)
    (30 9 5)
    (30 5 1)
    (30 5 0)
    (30 10 10)
    (30 10 9)
    (30 10 5)
    (30 10 1)
    (30 10 0)

    // Exit
    (30 2 5)
    (30 5 8)
    (30 5 2)
    (30 8 5)
);

blocks
(
    hex (0 5 21 16 1 6 37 17) (10 10 10) simpleGrading (1 1 1)
    hex (1 6 37 17 2 7 36 18) (10 10 10) simpleGrading (1 1 1)
    hex (2 7 36 18 3 9 38 19) (10 10 10) simpleGrading (1 1 1)
    hex (3 9 38 19 4 10 26 20) (10 10 10) simpleGrading (1 1 1)
    hex (5 11 27 21 6 12 28 37) (10 10 10) simpleGrading (1 1 1)
    hex (6 12 28 37 8 13 29 39) (10 10 10) simpleGrading (1 1 1)
    hex (8 13 29 39 9 14 30 38) (10 10 10) simpleGrading (1 1 1)
    hex (9 14 30 38 10 15 31 26) (10 10 10) simpleGrading (1 1 1)

    // nozzle
    hex (32 36 38 34 33 37 39 35) (10 10 10) simpleGrading (1 1 1)

    // Extension
    hex (16 21 45 40 17 37 46 41) (10 10 10) simpleGrading (1 1 1)
    hex (17 37 46 41 18 36 47 42) (10 10 10) simpleGrading (1 1 1)
    hex (18 36 47 42 19 38 49 43) (10 10 10) simpleGrading (1 1 1)
    hex (19 38 49 43 20 26 50 44) (10 10 10) simpleGrading (1 1 1)
    hex (21 27 51 45 37 28 52 46) (10 10 10) simpleGrading (1 1 1)
    hex (37 28 52 46 39 29 53 48) (10 10 10) simpleGrading (1 1 1)
    hex (39 29 53 48 38 30 54 49) (10 10 10) simpleGrading (1 1 1)
    hex (38 30 54 49 26 31 55 50) (10 10 10) simpleGrading (1 1 1)

    hex (36 47 49 38 37 46 48 39) (10 10 10) simpleGrading (1 1 1)

    // Nozzle Extension
    // hex (36 37 57 56 38 39 59 58) (10 10 10) simpleGrading (1 10 10)
    // hex (36 56 58 38 23 47 46 22) (10 10 10) simpleGrading (1 10 10)
    // hex (22 37 57 46 23 36 56 47) (10 10 10) simpleGrading (1 10 10)
    // hex (22 24 48 46 37 39 59 57) (10 10 10) simpleGrading (1 10 10)
);

edges
(
    // Exterior inlet
    arc 6 7 (0 2.88 7.12)
    arc 7 9 (0 2.88 2.88)
    arc 6 8 (0 7.12 7.12)
    arc 8 9 (0 7.12 2.88)

    // Exterior outlet
    arc 46 48 (30 7.83 7.83)
    arc 46 47 (30 2.17 7.83)
    arc 47 49 (30 2.17 2.17)
    arc 48 49 (30 7.83 2.17)

    // Interior Throat
    arc 33 35 (3.85 5.86 5.86)
    arc 32 33 (3.85 4.14 5.86)
    arc 32 34 (3.85 4.14 4.14)
    arc 34 35 (3.85 5.86 5.86)

    // Interior outlet
    arc 37 39 (13 7.12 7.12)
    arc 36 37 (13 2.88 7.12)
    arc 36 38 (13 2.88 2.88)
    arc 38 39 (13 7.12 7.12)

    // BSpline 6 22 (
    //   (3.87 5 6.21)
    //   (2.432 5 6.664)
    //   (3.616 5 6.232)
    //   (5.16 5 6.528)
    //   (8.12 5 7.456)
    // )
    // BSpline 7 23 (
    //   (3.87 3.79 5)
    //   (2.432 3.336 5)
    //   (3.616 3.768 5)
    //   (5.16 3.472 5)
    //   (8.12 2.544 5)
    // )
    // BSpline 8 24 (
    //   (3.87 6.21 5)
    //   (2.432 6.664 5)
    //   (3.616 6.232 5)
    //   (5.16 6.528 5)
    //   (8.12 7.456 5)
    // )
    // BSpline 9 25 (
    //   (3.87 5 3.79)
    //   (2.432 5 3.336)
    //   (3.616 5 3.768)
    //   (5.16 5 3.472)
    //   (8.12 5 2.544)
    // )
);

boundary
(
    walls
    {
        type walls;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
            (3 4 20 19)
            (26 20 4 10)
            (31 26 10 15)
            (30 31 15 14)
            (29 30 14 13)
            (28 29 13 12)
            (27 28 12 11)
            (11 5 21 27)
            (5 0 16 21)
            (11 12 6 5)
            (5 6 1 0)
            (12 13 8 6)
            (13 14 9 8)
            (14 15 10 9)
            (9 10 4 3)
            (7 9 3 2)
            (6 7 2 1)
        );
    }

    nozzleExt
    {
        type walls;
        faces
        (
            (6 8 39 37)
            (38 39 8 9)
            (7 6 37 36)
            (9 7 36 38)
        );
    }

    nozzleInt
    {
        type patch;
        faces
        (
            (38 39 35 34)
            (34 32 36 38)
            (35 33 37 39)
            (32 33 37 36)
        );
    }

    inlet
    {
        type patch;
        faces
        (
          (35 34 32 33)
        );
    }

    outlet
    {
        type patch;
        faces
        (
          (52 51 45 46)
          (53 52 46 48)
          (54 53 48 49)
          (55 54 49 50)
          (50 49 43 44)
          (49 47 42 43)
          (47 46 41 42)
          (46 45 40 41)
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
